In [132]:
## 예제 6-1

import seaborn as sns
import pandas as pd

In [133]:
titanic = sns.load_dataset('titanic')
titanic

df = titanic.loc[:, ['age','fare']]

df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [134]:
# 함수 정의
def add_10(n) :
    return n + 10
def add_a_b(a, b) :
    return a + b

print(add_a_b(5,4))

9

In [135]:

str = df['age'].apply(add_10)
str.head()

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64

In [136]:
sr1 = df[['age','fare']].apply(lambda x : x+10)
sr1

      age     fare
0    32.0  17.2500
1    48.0  81.2833
2    36.0  17.9250
3    45.0  63.1000
4    45.0  18.0500
..    ...      ...
886  37.0  23.0000
887  29.0  40.0000
888   NaN  33.4500
889  36.0  40.0000
890  42.0  17.7500

[891 rows x 2 columns]

In [137]:
def over_thity(age):
    return age>30

sr_map = df['age'].map(over_thity)
sr_map

0      False
1       True
2      False
3       True
4       True
       ...
886    False
887    False
888    False
889    False
890     True
Name: age, Length: 891, dtype: bool

In [138]:
sr_mpa2 = df['age'].map(lambda x : x>30)
sr_mpa2

0      False
1       True
2      False
3       True
4       True
       ...
886    False
887    False
888    False
889    False
890     True
Name: age, Length: 891, dtype: bool

In [139]:
print(titanic['sex'].unique())
print(titanic['sex'].head())

replace_dict = {'male' : 0,'female' : 1}
titanic['gender'] = titanic['sex'].map(replace_dict)
print('------------------')
print(titanic['gender'])

['male' 'female']
0      male
1    female
2    female
3    female
4      male
Name: sex, dtype: object
------------------
0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    1
889    0
890    0
Name: gender, Length: 891, dtype: int64

In [140]:
## 예제 6-2
df3 = df.map(add_a_b, b=10)
df3

      age     fare
0    32.0  17.2500
1    48.0  81.2833
2    36.0  17.9250
3    45.0  63.1000
4    45.0  18.0500
..    ...      ...
886  37.0  23.0000
887  29.0  40.0000
888   NaN  33.4500
889  36.0  40.0000
890  42.0  17.7500

[891 rows x 2 columns]

In [141]:
df = df.map(lambda a, b : a+b, b= 10)
df

      age     fare
0    32.0  17.2500
1    48.0  81.2833
2    36.0  17.9250
3    45.0  63.1000
4    45.0  18.0500
..    ...      ...
886  37.0  23.0000
887  29.0  40.0000
888   NaN  33.4500
889  36.0  40.0000
890  42.0  17.7500

[891 rows x 2 columns]

In [142]:
## 예제 6-3
def calc_stats(col) :
    max_val = col.max()
    min_val = col.min()
    mean_val = col.mean()   
    median_val = col.median()

    return pd.Series([max_val, min_val, mean_val, median_val], index=['Max', 'Min', 'Mean', 'Median'])

result_df = df.apply(calc_stats, axis=0)
result_df

              age        fare
Max     90.000000  522.329200
Min     10.420000   10.000000
Mean    39.699118   42.204208
Median  38.000000   24.454200

In [143]:
result_sr = df.apply(lambda x : x.max()- x.min())
result_sr

age      79.5800
fare    512.3292
dtype: float64

In [144]:
def calc_diff_avg(row):
    diff = row.max() - row.min()
    avg = row.mean()
    return pd.Series([diff, avg], index=['차이', '평균'])

result_sr2 = df.apply(calc_diff_avg, axis = 1)
result_sr2

          차이        평균
0    14.7500  24.62500
1    33.2833  64.64165
2    18.0750  26.96250
3    18.1000  54.05000
4    26.9500  31.52500
..       ...       ...
886  14.0000  30.00000
887  11.0000  34.50000
888   0.0000  33.45000
889   4.0000  38.00000
890  24.2500  29.87500

[891 rows x 2 columns]

In [145]:


result_df3 = df.apply(lambda row, multiplier: pd.Series([(row.max() - row.min()) * multiplier, row.mean()],
                                                         index=['차이', '평균']),multiplier = 2, axis=1)
result_df3

          차이        평균
0    29.5000  24.62500
1    66.5666  64.64165
2    36.1500  26.96250
3    36.2000  54.05000
4    53.9000  31.52500
..       ...       ...
886  28.0000  30.00000
887  22.0000  34.50000
888   0.0000  33.45000
889   8.0000  38.00000
890  48.5000  29.87500

[891 rows x 2 columns]

In [146]:
filter_columns = df.apply(lambda n : n.mean() >30) 
print(filter_columns)

filter_df = df.loc[:, filter_columns]
filter_df

age     True
fare    True
dtype: bool

      age     fare
0    32.0  17.2500
1    48.0  81.2833
2    36.0  17.9250
3    45.0  63.1000
4    45.0  18.0500
..    ...      ...
886  37.0  23.0000
887  29.0  40.0000
888   NaN  33.4500
889  36.0  40.0000
890  42.0  17.7500

[891 rows x 2 columns]

In [147]:
df['High'] = df.apply(lambda row: 'Yes' if row.mean() > 50 else 'No', axis=1)
df

      age     fare High
0    32.0  17.2500   No
1    48.0  81.2833  Yes
2    36.0  17.9250   No
3    45.0  63.1000  Yes
4    45.0  18.0500   No
..    ...      ...  ...
886  37.0  23.0000   No
887  29.0  40.0000   No
888   NaN  33.4500   No
889  36.0  40.0000   No
890  42.0  17.7500   No

[891 rows x 3 columns]

In [148]:
df1 = titanic.loc[:,['age','fare']]
df2 = titanic.loc[:, ['embark_town','embarked']]

def missing_value(df) :
    return df.isnull()  

result_df = df1.pipe(missing_value)

In [149]:
def missing_count(df) :
    return missing_value(df).sum()

result_mc = df.pipe(missing_count)
result_mc

age     177
fare      0
High      0
dtype: int64

In [150]:
def totoal_number_ms(df):
    return missing_count(df).sum()

result_ms = df.pipe(totoal_number_ms)
result_ms

np.int64(177)

In [151]:
# chain method - 함수 활용
def extract_initial(df):
    df['town_initial'] = df['embark_town'].str[0]
    return df
    

def verify_initial(df):
    df['verified'] = df['embarked'] == df['town_initial']
    return df
    
verify_initial(extract_initial(df2))

     embark_town embarked town_initial  verified
0    Southampton        S            S      True
1      Cherbourg        C            C      True
2    Southampton        S            S      True
3    Southampton        S            S      True
4    Southampton        S            S      True
..           ...      ...          ...       ...
886  Southampton        S            S      True
887  Southampton        S            S      True
888  Southampton        S            S      True
889    Cherbourg        C            C      True
890   Queenstown        Q            Q      True

[891 rows x 4 columns]

In [152]:
df2.pipe(extract_initial).pipe(verify_initial)

     embark_town embarked town_initial  verified
0    Southampton        S            S      True
1      Cherbourg        C            C      True
2    Southampton        S            S      True
3    Southampton        S            S      True
4    Southampton        S            S      True
..           ...      ...          ...       ...
886  Southampton        S            S      True
887  Southampton        S            S      True
888  Southampton        S            S      True
889    Cherbourg        C            C      True
890   Queenstown        Q            Q      True

[891 rows x 4 columns]

In [153]:
## 6-5
df = titanic.loc[:, 'survived':'age']
df.head()

   survived  pclass     sex   age
0         0       3    male  22.0
1         1       1  female  38.0
2         1       3  female  26.0
3         1       1  female  35.0
4         0       3    male  35.0

In [154]:
columns= list(df.columns)
print(columns)

['survived', 'pclass', 'sex', 'age']

In [155]:
columns_sort = sorted(columns, reverse=False)   
df_sort = df[columns_sort]
df_sort.head()

    age  pclass     sex  survived
0  22.0       3    male         0
1  38.0       1  female         1
2  26.0       3  female         1
3  35.0       1  female         1
4  35.0       3    male         0

In [156]:
columns_costom = ['pclass', 'sex', 'age', 'survived']
df_custom = df[columns_costom]
df_custom

     pclass     sex   age  survived
0         3    male  22.0         0
1         1  female  38.0         1
2         3  female  26.0         1
3         1  female  35.0         1
4         3    male  35.0         0
..      ...     ...   ...       ...
886       2    male  27.0         0
887       1  female  19.0         1
888       3  female   NaN         0
889       1    male  26.0         1
890       3    male  32.0         0

[891 rows x 4 columns]

In [157]:
## 6.7
titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age','sex', 'class', 'fare', 'survived']]

df.head()

    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
1  38.0  female  First  71.2833         1
2  26.0  female  Third   7.9250         1
3  35.0  female  First  53.1000         1
4  35.0    male  Third   8.0500         0

In [158]:
# class 열을 기준으로 분할
grouped = df.groupby(['class'], observed=True) 
print(grouped)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000025DDE128150>

In [159]:
for key, group in grouped:
    print('* key :', key)
    print('* number :', len(group))    
    print(group.head())
    print('\n')

* key : ('First',)
* number : 216
     age     sex  class     fare  survived
1   38.0  female  First  71.2833         1
3   35.0  female  First  53.1000         1
6   54.0    male  First  51.8625         0
11  58.0  female  First  26.5500         1
23  28.0    male  First  35.5000         1


* key : ('Second',)
* number : 184
     age     sex   class     fare  survived
9   14.0  female  Second  30.0708         1
15  55.0  female  Second  16.0000         1
17   NaN    male  Second  13.0000         1
20  35.0    male  Second  26.0000         0
21  34.0    male  Second  13.0000         1


* key : ('Third',)
* number : 491
    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
2  26.0  female  Third   7.9250         1
4  35.0    male  Third   8.0500         0
5   NaN    male  Third   8.4583         0
7   2.0    male  Third  21.0750         0

In [160]:
# 연산 메소드 적용
average = grouped.mean(numeric_only=True)
average

              age       fare  survived
class
First   38.233441  84.154687  0.629630
Second  29.877630  20.662183  0.472826
Third   25.140620  13.675550  0.242363

In [161]:
group3 = grouped.get_group(('Third',))
group3.head()

    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
2  26.0  female  Third   7.9250         1
4  35.0    male  Third   8.0500         0
5   NaN    male  Third   8.4583         0
7   2.0    male  Third  21.0750         0

In [162]:
# class 열, sex 열을 기준으로 분할
grouped_two = df.groupby(['class', 'sex'], observed=True) 

# grouped_two 그룹 객체를 iteration으로 출력
for key, group in grouped_two:
    print('* key :', key)
    print('* number :', len(group))    
    print(group.head())
    print('\n')

* key : ('First', 'female')
* number : 94
     age     sex  class      fare  survived
1   38.0  female  First   71.2833         1
3   35.0  female  First   53.1000         1
11  58.0  female  First   26.5500         1
31   NaN  female  First  146.5208         1
52  49.0  female  First   76.7292         1


* key : ('First', 'male')
* number : 122
     age   sex  class      fare  survived
6   54.0  male  First   51.8625         0
23  28.0  male  First   35.5000         1
27  19.0  male  First  263.0000         0
30  40.0  male  First   27.7208         0
34  28.0  male  First   82.1708         0


* key : ('Second', 'female')
* number : 76
     age     sex   class     fare  survived
9   14.0  female  Second  30.0708         1
15  55.0  female  Second  16.0000         1
41  27.0  female  Second  21.0000         0
43   3.0  female  Second  41.5792         1
53  29.0  female  Second  26.0000         1


* key : ('Second', 'male')
* number : 108
     age   sex   class  fare  survived
17   NaN  male  Second  13.0         1
20  35.0  male  Second  26.0         0
21  34.0  male  Second  13.0         1
33  66.0  male  Second  10.5         0
70  32.0  male  Second  10.5         0


* key : ('Third', 'female')
* number : 144
     age     sex  class     fare  survived
2   26.0  female  Third   7.9250         1
8   27.0  female  Third  11.1333         1
10   4.0  female  Third  16.7000         1
14  14.0  female  Third   7.8542         0
18  31.0  female  Third  18.0000         0


* key : ('Third', 'male')
* number : 347
     age   sex  class     fare  survived
0   22.0  male  Third   7.2500         0
4   35.0  male  Third   8.0500         0
5    NaN  male  Third   8.4583         0
7    2.0  male  Third  21.0750         0
12  20.0  male  Third   8.0500         0

In [163]:
average_two = grouped_two.mean(numeric_only=True)
average_two

                     age        fare  survived
class  sex
First  female  34.611765  106.125798  0.968085
       male    41.281386   67.226127  0.368852
Second female  28.722973   21.970121  0.921053
       male    30.740707   19.741782  0.157407
Third  female  21.750000   16.118810  0.500000
       male    26.507589   12.661633  0.135447

In [164]:
std_all_index = df.groupby(['class'], observed=True, as_index=False).std(numeric_only=True)  

std_all_index

    class        age       fare  survived
0   First  14.802856  78.380373  0.484026
1  Second  14.001077  13.417399  0.500623
2   Third  12.495398  11.778142  0.428949

In [165]:
std_all = grouped.std(numeric_only=True)  

std_all
std_all['fare']

class
First     78.380373
Second    13.417399
Third     11.778142
Name: fare, dtype: float64

In [166]:
std_all_index = df.groupby(['class'], observed=True, as_index=False).std(numeric_only=True)  

std_all_index

    class        age       fare  survived
0   First  14.802856  78.380373  0.484026
1  Second  14.001077  13.417399  0.500623
2   Third  12.495398  11.778142  0.428949

In [167]:
std_all['fare']

class
First     78.380373
Second    13.417399
Third     11.778142
Name: fare, dtype: float64

In [168]:
agg_sep = grouped.agg({'fare':['min', 'max'], 'age':'mean'})  
agg_sep

       fare                  age
        min       max       mean
class
First   0.0  512.3292  38.233441
Second  0.0   73.5000  29.877630
Third   0.0   69.5500  25.140620

In [169]:
def min_max(x):    # 최대값 - 최소값
    return x.max() - x.min()
    
# 각 그룹의 최대값과 최소값의 차이를 계산하여 그룹별로 집계
agg_minmax = grouped[['age', 'fare']].agg(min_max)  

agg_minmax

          age      fare
class
First   79.08  512.3292
Second  69.33   73.5000
Third   73.58   69.5500

In [170]:
## 6.9
grouped = df.groupby(['class'], observed=True) 

# fare 열을 그룹별로 누적 합산
grouped['fare'].cumsum()

0          7.2500
1         71.2833
2         15.1750
3        124.3833
4         23.2250
          ...
886     3801.8417
887    18147.4125
888     6706.9451
889    18177.4125
890     6714.6951
Name: fare, Length: 891, dtype: float64

In [171]:
df['fare_cumsum'] = grouped['fare'].cumsum()
df.head()

    age     sex  class     fare  survived  fare_cumsum
0  22.0    male  Third   7.2500         0       7.2500
1  38.0  female  First  71.2833         1      71.2833
2  26.0  female  Third   7.9250         1      15.1750
3  35.0  female  First  53.1000         1     124.3833
4  35.0    male  Third   8.0500         0      23.2250

In [172]:
def z_score(x): 
    return (x - x.mean()) / x.std()
   
# transform() 메소드를 이용하여 age 열의 데이터를 z-score로 변환
age_zscore = grouped['age'].transform(z_score)  
age_zscore

0     -0.251342
1     -0.015770
2      0.068776
3     -0.218434
4      0.789041
         ...
886   -0.205529
887   -1.299306
888         NaN
889   -0.826424
890    0.548953
Name: age, Length: 891, dtype: float64

In [173]:
age_zscore2 = grouped['age'].transform(lambda x: (x - x.mean()) / x.std())  
age_zscore2

0     -0.251342
1     -0.015770
2      0.068776
3     -0.218434
4      0.789041
         ...
886   -0.205529
887   -1.299306
888         NaN
889   -0.826424
890    0.548953
Name: age, Length: 891, dtype: float64

In [174]:
# 6.10
grouped[["sex", "survived"]].nth(1)

       sex  survived
2   female         1
3   female         1
15  female         1

In [175]:
grouped_filter = grouped.filter(lambda x: len(x) >= 200)  
grouped_filter

      age     sex  class     fare  survived  fare_cumsum
0    22.0    male  Third   7.2500         0       7.2500
1    38.0  female  First  71.2833         1      71.2833
2    26.0  female  Third   7.9250         1      15.1750
3    35.0  female  First  53.1000         1     124.3833
4    35.0    male  Third   8.0500         0      23.2250
..    ...     ...    ...      ...       ...          ...
885  39.0  female  Third  29.1250         0    6683.4951
887  19.0  female  First  30.0000         1   18147.4125
888   NaN  female  Third  23.4500         0    6706.9451
889  26.0    male  First  30.0000         1   18177.4125
890  32.0    male  Third   7.7500         0    6714.6951

[707 rows x 6 columns]

In [176]:
#6.11
grouped = df.groupby(['class'], observed=True) 

# 집계 : 각 그룹별 요약 통계정보를 집계
agg_grouped = grouped[['age', 'survived']].apply(lambda x: x.describe())   
agg_grouped

                     age    survived
class
First  count  186.000000  216.000000
       mean    38.233441    0.629630
       std     14.802856    0.484026
       min      0.920000    0.000000
       25%     27.000000    0.000000
       50%     37.000000    1.000000
       75%     49.000000    1.000000
       max     80.000000    1.000000
Second count  173.000000  184.000000
       mean    29.877630    0.472826
       std     14.001077    0.500623
       min      0.670000    0.000000
       25%     23.000000    0.000000
       50%     29.000000    0.000000
       75%     36.000000    1.000000
       max     70.000000    1.000000
Third  count  355.000000  491.000000
       mean    25.140620    0.242363
       std     12.495398    0.428949
       min      0.420000    0.000000
       25%     18.000000    0.000000
       50%     24.000000    0.000000
       75%     32.000000    0.000000
       max     74.000000    1.000000

In [177]:
def z_score(x):                          
    return (x - x.mean()) / x.std()

age_zscore = grouped[['age', 'survived']].apply(z_score)    
age_zscore

                age  survived
class
First 1   -0.015770  0.765188
      3   -0.218434  0.765188
      6    1.065103 -1.300819
      11   1.335321  0.765188
      23  -0.691315  0.765188
...             ...       ...
Third 882 -0.251342 -0.565014
      884 -0.011254 -0.565014
      885  1.109159 -0.565014
      888       NaN -0.565014
      890  0.548953 -0.565014

[891 rows x 2 columns]

In [178]:
# 필터링 : age 열의 데이터 평균이 30보다 작은 그룹만을 필터링하여 출력
age_filter = grouped[['age', 'survived']].apply(lambda x: x['age'].mean() < 30)  
print(age_filter, '\n')

# 필터링 결과로 조건을 충족하는 데이터프레임 반환
df.loc[df['class'].isin(age_filter[age_filter==True].index), ['age', 'survived']]

class
First     False
Second     True
Third      True
dtype: bool

      age  survived
0    22.0         0
2    26.0         1
4    35.0         0
5     NaN         0
7     2.0         0
..    ...       ...
884  25.0         0
885  39.0         0
886  27.0         0
888   NaN         0
890  32.0         0

[675 rows x 2 columns]

In [179]:
## 6.12
grouped = df.groupby(['class', 'sex'], observed=True) 
gdf = grouped.agg(['mean', 'std'], numeric_only=True)
gdf
gdf.index

MultiIndex([( 'First', 'female'),
            ( 'First',   'male'),
            ('Second', 'female'),
            ('Second',   'male'),
            ( 'Third', 'female'),
            ( 'Third',   'male')],
           names=['class', 'sex'])

In [180]:
arrays = [['a', 'a', 'b', 'b'], [1, 2, 1, 2]]
multi_index_arrays = pd.MultiIndex.from_arrays(arrays, names=('letter', 'number'))
multi_index_arrays

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           names=['letter', 'number'])

In [181]:
tuples = [('a', 1), ('a', 2), ('b', 1), ('b', 2)]
multi_index_tuples = pd.MultiIndex.from_tuples(tuples, names=('letter', 'number'))
multi_index_tuples

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           names=['letter', 'number'])

In [182]:
letters = ['a', 'b']
numbers = [1, 2]
multi_index_product = pd.MultiIndex.from_product([letters, numbers], 
                                                 names=('letter', 'number'))
multi_index_product

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           names=['letter', 'number'])

In [183]:
df = pd.DataFrame([['a', 1], ['a', 2], ['b', 1], ['b', 2]], columns=['letter', 'number'])
multi_index_frame = pd.MultiIndex.from_frame(df)
multi_index_frame

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           names=['letter', 'number'])

In [184]:
gdf.columns.get_level_values(1)

Index(['mean', 'std', 'mean', 'std', 'mean', 'std', 'mean', 'std'], dtype='object')

In [185]:
gdf.loc['First']

              age                   fare             survived            \
             mean        std        mean        std      mean       std
sex
female  34.611765  13.612052  106.125798  74.259988  0.968085  0.176716
male    41.281386  15.139570   67.226127  77.548021  0.368852  0.484484

        fare_cumsum
               mean          std
sex
female  9417.645071  5502.431968
male    9140.709907  5417.219290

In [186]:
gdf.loc[('First', 'female'), ('age', 'std'):('fare', 'mean')]

age   std      13.612052
fare  mean    106.125798
Name: (First, female), dtype: float64

In [187]:
male_class = gdf.xs('male', level='sex')
male_class

              age                  fare             survived            \
             mean        std       mean        std      mean       std
class
First   41.281386  15.139570  67.226127  77.548021  0.368852  0.484484
Second  30.740707  14.793894  19.741782  14.922235  0.157407  0.365882
Third   26.507589  12.159514  12.661633  11.681696  0.135447  0.342694

        fare_cumsum
               mean          std
class
First   9140.709907  5417.219290
Second  1916.574033  1118.345065
Third   3474.996019  1859.328795

In [188]:
gdf.sort_index(level=['sex', 'class'], ascending=[False, True])

                     age                   fare             survived  \
                    mean        std        mean        std      mean
class  sex
First  male    41.281386  15.139570   67.226127  77.548021  0.368852
Second male    30.740707  14.793894   19.741782  14.922235  0.157407
Third  male    26.507589  12.159514   12.661633  11.681696  0.135447
First  female  34.611765  13.612052  106.125798  74.259988  0.968085
Second female  28.722973  12.872702   21.970121  10.891796  0.921053
Third  female  21.750000  12.729964   16.118810  11.690314  0.500000

                         fare_cumsum
                    std         mean          std
class  sex
First  male    0.484484  9140.709907  5417.219290
Second male    0.365882  1916.574033  1118.345065
Third  male    0.342694  3474.996019  1859.328795
First  female  0.176716  9417.645071  5502.431968
Second female  0.271448  1876.618101  1057.277330
Third  female  0.501745  3079.955875  1919.602019